Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: We could not activate your account. Please make sure that you have clicked the correct link in your email or typed in the correct address.
ha: Ba za mu farfaɗo da asusunka ba. Ka tabbata ka danna haɗi dai dai a imel ɗinka ko ka buga adireshin dai dai.

source: We could not unsubscribe you from this question: <a href="%(question_url)s">%(question_title)s</a>. Please make sure you copied and pasted the unsubscribe link correctly.
ha: Ba zamu iya janye sautu daga wannan tambaya ba: <a href="%(question_url)s">%(question_title)s</a>. Ka tabbata ka kwafa kuma ka liƙa haɗin janye sautu dai dai.

source: We couldn't find any matching tweets for %(language)s at this time. Please check again later, choose a different tweet type from the menu above, or view tweets for other languages by using the language selector at the bottom of the page.
ha: Bamu sami tweets ɗin da suka dace ba domin %(language)s a wannan lokaci. Sake dubawa nan gaba, zaɓi tweet daban daga jerin bayani na sama, ko ka kalli tweets daga wasu yaruka ta amfani da zaɓin yare a ƙasan shafi.

source: We couldn't find any results for <strong>{q}</strong> in <strong>{l}</strong>. Maybe one of these articles will be helpful?
ha: Mun kasa samun sakamako na <strong>{q}</strong> a <strong>{l}</strong>. Mai yiwuwa ɗaya daga cikin waɗannan maƙaloli za ta taimaka?

source: We couldn't perform your request. Perhaps because the action is no longer applicable or you tried to perform an invalid action.
ha: Muna kasa yin abin da ka nema. Mai yiwuwa sabo da an daina samun aikin da ka nema ko yi ƙoƙarin yin aiki wanda ba shi da inganci.

source: Week beginning %(year)s-%(month)s-%(date)s
ha: Farkon mako %(year)s-%(month)s-%(date)s

source: Weekly meetings
ha: Taron mako-mako

source: We just wanted to let you know that %(answerer)s has found a solution to a Firefox question that you're following.
ha: Kawai muna so ka sani cewa %(answerer)s sun warware matsala ga tambayoyin Firefox da ka ke bi.

source: Welcome to SUMO!
ha: Barka da zuwa SUMO!

source: We need your help!
ha: Muna bukatar taimakonka!

source: We're sorry to see you go.
ha: Ba mu ji daɗin tafiyarka ba.

source: We've just received a request to send the username linked to this email address.
ha: Yanzu muka sami bukata ta aika sunan mai amfani wanda ke da haɗi da wannan adireshin na imel.

source: We've made some educated guesses about your current browser and operating system.
ha: Mun yi wasu zaɓi cikin ilimi dangane da mai kewayawarka ta yanzu da kuma tsarin mai tafiyarwarka.

source: We've sent a confirmation to %(new_email)s. Please follow the link in the confirmation to change your account's email.
ha: Mun aika da tabbatarwa zuwa %(new_email)s. Bi wannan haɗin a tabbatarwar domin canja asusunka na imel.

source: We've sent an email to any account using this address. Please follow the link in the email to reset your password.
ha: Mun aika da imel ga duk asusun da ke amfani da wannan adireshi. Bi wannan haɗi a cikin imel ɗin domin sake saita kalmar wucewarka.

source: We've sent an email with the username to any account using {email}.
ha: Mun aika da imel da sunan mai amfani zuwa ga duk wani asusu mai amfani da {email}.

source: We would love to find a good place for you to help users, so please send us an email with your username and the area you would like to get involved. Please feel free to add all your skills, we will try to find the right use for them :)
ha: Muna ƙaunar mu sami wuri mai kyau domin ka taimakawa masu amfani, aiko mana da imel da sunanka na mai amfani da kuma ɓangaren da ka ke so ka shiga. Saki jikinka ka ƙara duk ƙwarewarka, za mu nemo wurin da ya dace da su :)

source: What is your reply about?
ha: Mece ce dangane da amsarka?

source: What Links Here
ha: Waɗan ne Haɗi a Nan

source: What Links Here | {document}
ha: Waɗan ne Haɗi a Nan | {document}

source: What's New
ha: Mene ne Sabo

source: When German misses a level 2 change, the coverage drops to 50%, so 1% of 10%= 0.1% overall
ha: Idan Jamus ta rasa canji mai mataki na 2, isarwar za ta sauka zuwa 50%, sabo da haka 1% na 10%= 0.1% a gaba ɗaya

source: When the Home page article is the only localized article and it's up to date in German, then our overall coverage is 2% of 10%=0.2% overall (+ the English coverage)
ha: Idan Shafin Gidan shi kaɗai ne maƙalar da aka fassara kuma har zuwa yau a Jamusanci ya ke, sabo da haka isarwarmu gaba ɗaya ita ce 2% na 10%=0.2% gaba ɗaya (+ isarwar Turanci)

source: Where all the action happens
ha: Inda duk aikin ya ke faruwa

source: Which category best describes your problem?
ha: Wane kaso ne ya fi kwatanta matsalarka?

source: Which product would you like to post a question about?
ha: Wane kaya ne kake so ka aika tambaya a kansa?

source: While you wait
ha: Lokacin da ka ke saurare

source: Why should I help?
ha: Me ya sa zan taimaka?

source: Windows 8 Touch support articles
ha: Maƙaloli na tallafin Window 8 Touch

source: Working with messages
ha: Yin aiki da saƙwanni

source: Would you like to view this page in %(language)s instead?
ha: Kana so ka ga wannan shafi a %(language)s maimako?

source: Write help articles
ha: Rubuta maƙaloli na taimako

source: Yes, I am.
ha: E, na yi.

source: Yesterday
ha: Jiya

source: You already flagged this content.
ha: Ka saka alamar tuta ga wannan abin ciki.

source: You already voted on this Article.
ha: Ka riga ka yi zaɓe a kan wannan Maƙala.

source: You already voted on this reply.
ha: Ka riga ka zaɓi wannan amsa.

source: You and 1 other replied
ha: Kai da wani 1 kun amsa

source: You are about to approve your own edit. Please consider asking our <a href="%(url)s">reviewers</a> instead.
ha: Ka na gaf da amincewa da gyaranka. Yi tunanin tambayar <a href="%(url)s">masu sake nazarinmu</a> maimako.

source: You are about to mark this revision <span class="revtime"></span> as Ready for Localization. Are you sure you wish to proceed?
ha: Ka na gaf da saka alama ga wannan nazari <span class="revtime"></span> a matsayin Shiryawa domin Fassara. Ka tabbata ka na so ka ci gaba?

source: You are about to permanently delete the avatar. <strong>This cannot be undone!</strong> You can always upload another avatar to replace the current one.
ha: Kana kusa da goge hoton ƙungiya din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ko yaushe za ka iya loda wani hoton domin maye gurbin na yanzu.

source: You are about to permanently delete this answer. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana gaf da goge wannan amsa din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata kana so ka ci gaba?

source: You are about to permanently delete this document. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Ka na gaf da goge wannan daftari din din din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata ka na so ka ci gaba?

source: You are about to permanently delete this image. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana gaf da goge wannan hoto din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata kana so ka ci gaba?

source: You are about to permanently delete this post. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana gaf da goge wannan aiken din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata kana so ka ci gaba?

source: You are about to permanently delete this question. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana gaf da goge wannan tambayar din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata kana so ka ci gaba?

source: You are about to permanently delete this revision. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Ka na gaf da goge wannan nazari din din din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata ka na so ka ci gaba?

source: You are about to permanently delete this thread. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana gaf da goge wannan tattaunawa din-din-din. <strong>Ba za'a iya fasa wannan ba!</strong> Ka tabbata ka na so ka ci gaba?

source: You are about to permanently delete this video. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ha: Kana kusa da goge wannan bidiyo din-din-din. <strong>Ba za'a iya wannan ba!</strong> Ka tabbata kana so ka ci gaba?

source: You are about to permanently delete your avatar. <strong>This cannot be undone!</strong> You can always <a href="%(upload_url)s">upload another avatar</a> to replace your current one.
ha: Kana gaf da goge hotonka din din din. <strong>Ba za'a iya fasa wannan ba!</strong> Ko yaushe za ka iya <a href="%(upload_url)s">loda wani hoton</a> domin maye gurbin na yanzu.

source: You are about to subscribe to:
ha: Kana kusa da yin sautu zuwa:

source: You are not currently watching anything.
ha: A yanzu ba ka kallon komai.

source: You are not logged in.
ha: Ba ka sami mashiga ba.

source: You are not watching this thread
ha: Ba ka kallon wannan tattaunawa

source: You are now part of the Contributors group!
ha: Yanzu kana cikin ƙungiyar Masu Bayar da Gudun Mawa!

source: You are translating an English document which is not yet ready for localization.
ha: Ka na fassara daftari na Turanci wanda bai shirya domin fassara ba.

source: You are watching this thread
ha: Kana kallon wannan tattaunawa

source: You can also apply to our Buddy Program and get guidance from our more experienced contributors. Just introduce yourself in the forum for New Contributors by starting a new thread. Put your name on the thread title and tell us a bit about yourself:
ha: Za kuma ka iya nema zuwa tsarinmu na Buddy Program kuma ka sami jagoranci daga ƙwarrarun masu bayar da gudun mawarmu. Kawai ka gabatar da kanka a dandalin a maysayin Sabon Mai Bayar da Gudun mawa ka fara sabuwar tattunawa. Rubuta sunanka a taken tattaunawar kuma ka yi taƙaitaccen bayani a kanka:

source: You can log in at:
ha: Za ka iya shiga a:

source: You cannot translate this document.
ha: Ba za ka fassara wannan daftari ba.

source: You can now log in.
ha: Za ka iya shiga yanzu.

source: You can view the solution using the link below.
ha: Za ka iya ganin bayani ta amfani da haɗi na ƙasa.

source: You do not have permission to access this page.
ha: Baka da izini na samun dama ga wannan shafi.

source: You do not have permission to do that.
ha: Ba ka da izinin yin wannan.

source: You don't need to register to <a href="{url}">ask a question</a>.
ha: Ba ka bukatar yin rijista a <a href="{url}">yi tambaya</a>.

source: You have been automatically logged in.
ha: An shigar da kai kai-tsaye.

source: You have been awarded the <strong>%(title)s</strong> badge!
ha: An baka <strong>%(title)s</strong> bajo!

source: You have been awarded the %(title)s badge!
ha: An ba ka %(title)s bajo!

source: You have been unsubscribed.
ha: An cireka daga sautu.

source: You have exceeded the number of private messages that can be sent in a day.
ha: Ka wuce adadin saƙwanni na ƙashin kai da za'a iya aikawa a rana.

source: You have exceeded the number of threads and replies that can be posted in a given amount of time. Please try again shortly.
ha: Ka wuce adadin tattaunawa da amsoshi da za'a iya aikawa a wani tsawon lokaci da aka bayar. Sake gwadawa nan gaba kaɗan.

source: You have flagged this content. A moderator will review your submission shortly.
ha: Ka saka alamar tuta ga wannan abin ciki. Mai shiga tsakani zai yi nazarin miƙawarka ba da daɗewa ba.

source: You have not selected an image to upload.
ha: Baka zaɓi hoton da za ka loda ba.

source: You have successfully changed your password.
ha: Ka sami nasarar canja kalmar wucewarka.

source: You have successfully changed your password. <a href="%(profile_url)s">Go back to edit profile page.</a>
ha: Ka sami nasarar canja kalmar wucewarka. <a href="%(profile_url)s">Koma baya ka canja shafin tarihi.</a>

source: You may log in at https://{domain}{login_url}
ha: Za ka iya shiga a https://{domain}{login_url}

source: You might just make someone's day!
ha: Mai yiwuwa ka sa wani fari ciki a yau!

source: You must <a href="{login_url}">log in to your account</a> to reply to posts. Please <a href="{ask_url}">start a new question</a>, if you do not have an account yet.
ha: Dole ka <a href="{login_url}">shiga asusunka</a> domin bayar da amsa ga aike. <a href="{ask_url}">fara sabuwar tambaya</a>, idan har yanzu ba ka da asusu.

source: You must have cookies enabled to login or register.
ha: Dole sai ka kunna kukis domin shiga ko yin rijista.

source: Your account is already activated, log in below.
ha: Tuni an farfaɗo da asusunka, shiga ƙasa.

source: Your account is successfully verified, and your question is now posted on the Mozilla community support forum.
ha: An sami nasarar tantance asusunka, kuma tambayarka an aikata a dandalin tallafi na jama'ar Mozilla.

source: Your account was sucessfully closed!
ha: An sami nasarar rufe asusunka!

source: Your avatar will be resized to {size}x{size}
ha: Za'a sake girman hotonka zuwa {size}x{size}

source: Your content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Abin ciki naka ya yi gajarta (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Your email has been changed from {old_email} to {new_email}.
ha: An canja imel ɗin ka daga {old_email} zuwa {new_email}.

source: You replied
ha: Ka amsa

source: Your issue has been submitted successfully. You should receive a confirmation email and hear back from us shortly.
ha: An miƙa batunka cikin nasara. Za ka sami saƙon imel na tabbatarwa kuma za ka ji daga garemu ba da daɗewa ba.

source: Your message is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Saƙonka ya yi gajarta ƙwarai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Your message was sent!
ha: An aika saƙonka!

source: You rock! We'll send an email to let you know if your changes get approved. You can follow the discussion about this article by clicking the Discussion tab.
ha: Ka fi fice! Za mu aika maka da saƙon imel domin mu sanar da kai idan an amince da canje-canjenka. Za ka iya bin tattaunawar dangane da wannan maƙala ta danna madannin Tattaunawa.

source: Your password was successfully reset.
ha: Ka sami nasarar sake saita kalmar wucewarka.

source: Your question is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Tambayarka ta yi gajarta sosai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Your revision has been approved: {title}
ha: An amince da nazarinka: {title}

source: Your revision has been reviewed.
ha: An duba nazarinka.

source: Your revision has been reviewed: {title}
ha: An sake nazarin nazarinka: {title}

source: Your settings have been saved.
ha: An ajiye saitunanka.

source: Your title is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Takenka ya yi gajarta ƙwarai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Your username is:
ha: Sunanka na mai amfani shi ne:

source: Your username on %s
ha: Sunan mai amfaninka a %s

source: Your username will be shown next to your question in our public support forums.
ha: Za'a nuna sunan mai amfaninka kusa da tambayarka a dandalinmu na tallafawa al'umma.

source: Your Web browser doesn't appear to have cookies enabled. Cookies are required for logging in.
ha: Bisa ga dukkan alamu Mai Gewayawa ta yanar gizonka bata kunna kukis ba. Ana bukatar kukis domin shiga.

source: You should receive an email shortly to confirm your subscription.
ha: Za ka sami imel cikin lokaci kaɗan domin tabbatar da sautunka.

source: You've confirmed your email address and activated your account! You can now log in, and go edit your profile.
ha: Ka tabbatar da adireshinka na imel kuma ka farfaɗo da asusunka! Yanzu za ka iya shiga, kuma ka je ka gyara tarihinka.

source: You were awarded the '{title}' badge!
ha: An ba ka matsayin '{title}' bajo!

source: You will always control every tweet you post.
ha: Ko yaushe za ka sarrafa duk tweet ɗin da ka aika.

source: You will be notified of updates by email.
ha: Za'a sanar da kai sabuntawa ta imel.

source: You will be unsubscribed from: <br><strong>%(object)s</strong>
ha: Za ka daina sautu daga: <br><strong>%(object)s</strong>

source: You will need to confirm the newly set email address to complete the change.
ha: Ka na bukatar ka tabbatar da saita sabon adireshinka na imel domin gama canji.

source: You will no longer receive email updates for this question: <a href="%(question_url)s">%(question_title)s</a>
ha: Ka daina samun saƙon imel na sabuntawa domin wannan tambayar: <a href="%(question_url)s">%(question_title)s</a>

source: You will now receive updates via email.
ha: Yanzu za ka dinga samun sabuntawa ta hanyar imel.

source: abnormality
ha: rashin daidaituwa

source: add-on
ha: ƙari-kan

source: aggregate
ha: tara

source: All Hands
ha: Duƙƙan Hannaye

source: alternate text
ha: zaɓin rubutu

source: appear
ha: bayyana

source: appearance
ha: bayyanuwa

source: attack
ha: ƙai hari

source: attacker
ha: mai ƙai hari

source: Attack Site
ha: wurin ƙai hari

source: attendee
ha: mai hallara

source: authenticate
ha: gaskata

source: authenticated
ha: ingantacce

source: autoplay
ha: kunnawa da kansa

source: back out
ha: ƙoma baya

source: black box
ha: baƙin akwati

source: bookmark
ha: alamar shafi

source: boolean
ha: bolan

source: boot
ha: taya

source: breakpoint
ha: hutu batu

source: Bug report
ha: Rahoton bug

source: certificate authority
ha: ikon takardar shaida

source: channel
ha: tasha

source: clipboard
ha: allo mai riƙe takarda

source: clockwise
ha: kewaye ta hannun dama

source: compact
ha: matsetse

source: compact - recommend deprioritize
ha: matsetse - bayar da shawarar ƙaddamar da ƙasa

source: context
ha: mahallin

source: contribute
ha: bada gudumawa

source: corrupt
ha: lalatacce

source: corrupted
ha: gurɓacece

source: counterclockwise
ha: hana tafiya ta hannun dama

source: cryptominer
ha: yin anfani da ƙudin intanet

source: cryptomining
ha: yin anfani da kasuwancin ƙudin intanet

source: debug
ha: cire ƙuskure

source: deceptive site
ha: shafin yaudara

source: decode
ha: karantawa

source: decryption
ha: kwatantawa

source: disinformation
ha: labari wanda ya zo a murɗe

source: distrust
ha: rashin yarda

source: eavesdropping
ha: sauraron bayani

source: enable
ha: kunna

source: encode
ha: rikodin

source: encrypt
ha: ɓoye

source: encryption
ha: ɓuyar bayanai

source: end user
ha: mai anfani dashi na karshe

source: Enhanced Tracking Protection
ha: ingantacce bin sawu

source: executable file
ha: fayil mai zartarwa

source: extension
ha: ƙarin tsawo

source: external
ha: na waje

source: Fellow
ha: ɗan'uwanmu

source: filter bubble
ha: tace ƙumfa ta intanet

source: fingerprinter
ha: zanen yatsan hannu

source: fingerprinting
ha: ciro zanen yatsan hannu

source: gear
ha: kaya

source: grassroots
ha: tushe

source: home page
ha: shafin gida

source: idle
ha: rago

source: import
ha: shigowa da

source: innovations
ha: sababbin abubuwa

source: insecure
ha: rashin tsaro

source: installation
ha: kafuwa

source: Issue
ha: matsala

source: Legacy extension
ha: faɗaɗa gado

source: misinformation
ha: labari wanda ya zo a murɗe

source: native
ha: ʻyar kasa

source: open source
ha: buɗeɗiyar tushi

source: override
ha: mayewa

source: participation
ha: hallara

source: Patch
ha: faci

source: pop-up
ha: ɓullowa

source: preference
ha: fifiko

source: release
ha: saki

source: report
ha: rohoto

source: revert
ha: koma

source: search suggestion
ha: shawarwarin binciƙe

source: security keys
ha: makullan tsaro

source: sensitive
ha: mai buƙatar kula

source: sidebar
ha: labarun gefe

source: sign
ha: sa hannu

source: signer
ha: mai sa hannu

source: studies
ha: karatu

source: track
ha: bin sahu

source: trackers
ha: masu bin sahu

source: Tracking Content
ha: Abun bin Sahu

source: Turbo Mode
ha: Yanayin Turbo

source: unencrypted
ha: ba a ɓoye ba

source: unresponsive
ha: bai amsa ba

source: unsafe
ha: amintacce

source: validate
ha: inganta

source: validity
ha: inganci

source: version
ha: iri

source: Web Authentication
ha: Tabbatar da Yanar gizo
